4.gas-liquid shock tube/HLLC/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    sides
    {
        type            patch;
        nFaces          2;
        startFace       4999;
    }
    empty1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       5001;
    }
    empty2
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       15001;
    }
)

// ************************************************************************* //
